Revit 2026 API

# DoubleClickOptionsSetRenameOnSlowDoubleClickInProjectBrowser Method

---

Sets whether the desired action is to rename item in project browser on slow double-click.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetRenameOnSlowDoubleClickInProjectBrowser(
	bool bRenameOnSlowDoubleClickInProjectBrowser
)
```
```vb
Public Sub SetRenameOnSlowDoubleClickInProjectBrowser (
	bRenameOnSlowDoubleClickInProjectBrowser As Boolean
)
```
```cpp
public:
void SetRenameOnSlowDoubleClickInProjectBrowser(
	bool bRenameOnSlowDoubleClickInProjectBrowser
)
```
```fsharp
member SetRenameOnSlowDoubleClickInProjectBrowser :
        bRenameOnSlowDoubleClickInProjectBrowser : bool -> unit
```

#### Parameters

bRenameOnSlowDoubleClickInProjectBrowser Boolean

#### Reference

DoubleClickOptions Class

Autodesk.Revit.UI Namespace